Задания 14
Задание 14.1.
# Представление Invoices даёт сразу всю 
# необходимую информацию для обработки заказов.
# Orders же даёт краткую информацию о заказах, а уточнение
# нужно брать из других таблиц.

Задание 14.2.
# Рассчитывает сумму продаж по категориям за 1997 год.


Задание 14.3.
# Находит заказы за 1997 год с суммой продажи более 2500.

Задание 14.4.
# Находит товары с ценой выше средней.

Задание 14.5.
# Находит выполненные заказы и расчитывает сумму по каждому заказу.