Categories - один ко многим
Contacts - один к одному
Customers - один ко многим
Employees - один ко многим
EmployeeTerritories - многие ко многим (сотрудникам присваиваются территории)
Order Details - многие ко многим (переплетение продуктов в каждом заказе) 
Orders - многие ко многим (к номеру заказа переплетение клиента, сотрудника, грузотправителя)
Products - многие ко многим (на каждый продукт приходится поставщик и категория)
Region - один ко многим
Shippers - один ко многим
Suppliers - один ко многим
Territories - один ко многим